In [1]:
import pandas as pd
import numpy as np
import finance_func as ff

### Функция доходности

```python
change(data, periods=1)
```

Функция `change` принимает на вход данные в формате `pd.DataFrame` или `pd.Series`. А на выходе возвращает информацию того же формата о доходности финансового инструмента за промежуток времени

$$
\delta = \frac{V_{t}-V_{t-1}}{V_{t-1}}
$$

In [13]:
# Series example
s = pd.Series([2.36, np.nan, np.nan, 2.39, 2.25])

In [14]:
s

0    2.36
1     NaN
2     NaN
3    2.39
4    2.25
dtype: float64

In [15]:
ff.change(s)

0         NaN
1    0.000000
2    0.000000
3    0.012712
4   -0.058577
dtype: float64

In [16]:
# DataFrame example
df = pd.DataFrame({
    'TST1': [85, 86, 29],
    'TST2': [36.2, 37.8, 39.9],
    'TST3': [0.1685, np.nan, 0.1683]})

In [17]:
df

   TST1  TST2    TST3
0    85  36.2  0.1685
1    86  37.8     NaN
2    29  39.9  0.1683

In [18]:
ff.change(df)

       TST1      TST2      TST3
0       NaN       NaN       NaN
1  0.011765  0.044199  0.000000
2 -0.662791  0.055556 -0.001187

### Функция изменчивости данных

```python
change_ln(data, periods=1)
```

Функция `change_ln` принимает на вход данные в формате `pd.DataFrame` или `pd.Series`. А на выходе возвращает информацию того же формата об изменчивости данных.

$$
\delta_{t} = \ln{\frac{V_{t}}{V_{t-1}}}
$$

С математической точки зрения, в отличие от функции `change`, логарифм показывает относительное изменение.

```
>>> s = pd.Series([28, 30, 28])
>>> ff.change(s)
0         NaN
1    0.071429
2   -0.066667
dtype: float64

>>> ff.change_ln(s)
0         NaN
1    0.068993
2   -0.068993
dtype: float64
```
Т.е. в первом случае стоимость финансового инструмента сначала выросла на 7.14%, а затем снизилась на 6.67%. Хотя конечная стоимость не отличается от первоначальной. А во втором случае наблюдается такая картина, что стоимость финансового инструмента сначала выросла на 6.7%, а затем снизилась также на 6.7%.

In [19]:
# Series example
s = pd.Series([28, 30, 28], name='TST')

In [20]:
s

0    28
1    30
2    28
Name: TST, dtype: int64

In [21]:
ff.change_ln(s)

0         NaN
1    0.068993
2   -0.068993
Name: TST, dtype: float64

In [22]:
# Series example
s = pd.Series([np.nan, 12, np.nan, np.nan, 12.5, 12.85, 12.83])

In [23]:
s

0      NaN
1    12.00
2      NaN
3      NaN
4    12.50
5    12.85
6    12.83
dtype: float64

In [24]:
ff.change_ln(s)

0         NaN
1         NaN
2    0.000000
3    0.000000
4    0.040822
5    0.027615
6   -0.001558
dtype: float64

In [25]:
# DataFrame example
df = pd.DataFrame({
    'TST1': [85, 86, 29],
    'TST2': [36.2, 37.8, 39.9],
    'TST3': [0.1685, np.nan, 0.1683]})

In [26]:
df

   TST1  TST2    TST3
0    85  36.2  0.1685
1    86  37.8     NaN
2    29  39.9  0.1683

In [27]:
ff.change_ln(df)

       TST1      TST2      TST3
0       NaN       NaN       NaN
1  0.011696  0.043250  0.000000
2 -1.087051  0.054067 -0.001188